fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧаса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ВКМ_СоздатьЭлементыФормы();
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВКМ_УстановитьВидимостьЭлементов();	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВКМ_УстановитьВидимостьЭлементов();	
	
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВКМ_СоздатьЭлементыФормы()
	
		Если Элементы.Найти("ВКМ_ДатаНачала") = Неопределено Тогда
		ЭлементДатаНачала = Элементы.Добавить("ВКМ_ДатаНачала", Тип("ПолеФормы"));
		ЭлементДатаНачала.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементДатаНачала.ПутьКДанным = "Объект.ВКМ_ДатаНачала";
		ЭлементДатаНачала.Заголовок = "Дата начала действия";
		КонецЕсли;
		
		Если Элементы.Найти("ВКМ_ДатаОкончания") = Неопределено Тогда
		ЭлементДатаОкончания = Элементы.Добавить("ВКМ_ДатаОкончания", Тип("ПолеФормы"));
		ЭлементДатаОкончания.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементДатаОкончания.ПутьКДанным = "Объект.ВКМ_ДатаОкончания";
		ЭлементДатаОкончания.Заголовок = "Дата окончания действия";
		КонецЕсли;
		
		Если Элементы.Найти("ВКМ_СуммаАбонентскойПлаты") = Неопределено Тогда	
		ЭлементСуммаАбоненсткойПлаты = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"));
		ЭлементСуммаАбоненсткойПлаты.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементСуммаАбоненсткойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
		ЭлементСуммаАбоненсткойПлаты.Заголовок = "Сумма абонентской платы";
	   	КонецЕсли;
		
		Если Элементы.Найти("ВКМ_СтоимостьЧаса") = Неопределено Тогда		
		ЭлементСтоимостьЧаса = Элементы.Добавить("ВКМ_СтоимостьЧаса", Тип("ПолеФормы"));
		ЭлементСтоимостьЧаса.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементСтоимостьЧаса.ПутьКДанным = "Объект.ВКМ_СтоимостьЧаса";
		ЭлементСтоимостьЧаса.Заголовок = "Стоимость часа";
		КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВКМ_УстановитьВидимостьЭлементов()
	
	ЭтоАбонентскоеОбслуживание = Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание");
		
	Элементы.ВКМ_ДатаНачала.Видимость = ЭтоАбонентскоеОбслуживание;
	Элементы.ВКМ_ДатаОкончания.Видимость = ЭтоАбонентскоеОбслуживание;
	Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = ЭтоАбонентскоеОбслуживание;
	Элементы.ВКМ_СтоимостьЧаса.Видимость = ЭтоАбонентскоеОбслуживание;
	
КонецПроцедуры



#КонецОбласти
